[{"model": "products.brand", "pk": 1, "fields": {"name": "taylormade", "friendly_name": "Taylormade", "slug": "taylormade", "description": "TaylorMade Golf Company is an American sports equipment manufacturing company based in Carlsbad, California, United States. The company focuses on the golf equipment market, producing golf clubs, balls, and clothing."}}, {"model": "products.brand", "pk": 2, "fields": {"name": "nike", "friendly_name": "Nike", "slug": "nike", "description": "The world's largest athletic apparel company, Nike is best known for its footwear, apparel, and equipment. Founded in 1964 as Blue Ribbon Sports, the company became Nike in 1971 after the Greek goddess of victory. One of the most valuable brands among sport businesses, Nike employs over 76,000 people worldwide."}}, {"model": "products.brand", "pk": 3, "fields": {"name": "cleveland", "friendly_name": "Cleveland", "slug": "cleveland", "description": "Cleveland Golf creates Men's Golf Clubs with state of the art materials, cutting-edge processes, and proprietary technologies that help you play better golf. With men's golf equipment advancements that you can't get anywhere else, Cleveland Golf helps you dominate all over the course."}}, {"model": "products.brand", "pk": 4, "fields": {"name": "callaway", "friendly_name": "Callaway", "slug": "callaway", "description": "Founded in 1982, Callaway is renowned for developing innovative products that help golfers hit longer and straighter shots from tee to green; controlled, higher-spinning shots around the green; and smooth, accurate putts. The long list of legendary Callaway products introduced across the past three decades is long, punctuated by the iconic Big Bertha driver, which drove Callaway to the top of the industry in the early 1990s, and the Great Big Bertha driver, which Golf Digest named “the greatest club of all time” for its combination of innovation, performance and lasting impact on the golf equipment landscape."}}, {"model": "products.brand", "pk": 5, "fields": {"name": "footjoy", "friendly_name": "Footjoy", "slug": "footjoy", "description": "FootJoy is the undisputed #1 shoe in golf, an iconic golf brand with more than 100 years of shoemaking excellence and leadership positions in every major market around the world. The brand has been trusted by all of the greatest professional golfers in the world and has been the #1 shoe at every tournament on the PGA Tour since 1945, because of a singular dedication to the game and relentless commitment to performance innovation, style, comfort, quality and service."}}, {"model": "products.brand", "pk": 6, "fields": {"name": "titleist", "friendly_name": "Titleist", "slug": "titleist", "description": "Titleist has been in the golf industry for decades and is a leader in the golf ball and equipment market. Titleist is derived from the word Titlist which means title holder. Titleist is a subsidiary of Acushnet and partner brands within the company are Pinnacle (golf balls) and Footjoy shoes."}}, {"model": "products.brand", "pk": 7, "fields": {"name": "ping", "friendly_name": "Ping", "slug": "ping", "description": "PING is an American golfing equipment manufacturer based in Phoenix, Arizona. It is best known for its putters, but it also produces irons, drivers, and golf bags."}}, {"model": "products.brand", "pk": 8, "fields": {"name": "cobra", "friendly_name": "Cobra", "slug": "cobra", "description": "Cobra Golf is a sports equipment manufacturing company based in Carlsbad, California, focused on golf equipment, producing a wide range of golf clubs. The company is currently a subsidiary of Puma."}}, {"model": "products.brand", "pk": 9, "fields": {"name": "scotty_cameron", "friendly_name": "Scotty Cameron", "slug": "scotty_cameron", "description": "Scotty Cameron is an American sports equipment brand established by Don T. \"Scotty\" Cameron (born 8 November 1962), a golf club manufacturer primarily known for making putters. Scotty Cameron is part of the Acushnet Company brand portfolio since 2011, when the corporation acquired it from Fortune Brands. U.S."}}]