[{"model": "products.product", "pk": 1, "fields": {"category": 1, "gender": 1, "sku": "dr01ml", "name": "TaylorMade STEALTH 2 Plus Golf Driver", "brand": 1, "description": "The new TaylorMade STEALTH 2 PLUS driver is designed for speed and forgiveness. The corrective tendencies of Twist Face™ combined with advanced ICT help maintain ball speed and accuracy on off-center strikes. A lightweight full-carbon body allows engineers to harvest mass and place a 15-gram weight on a sliding track for optimal launch and forgiveness.", "has_degrees": true, "price": "500.00", "image_url": null, "image": "TM-Stealth2-HD-Driver.webp"}}, {"model": "products.product", "pk": 2, "fields": {"category": 1, "gender": 2, "sku": "dr01wn", "name": "Callaway Paradym X Driver Ladies", "brand": 4, "description": "The Paradym X Driver is built for a high launch with high MOI, along with a generously stretched profile at address. This model is best suited for golfers seeking extreme forgiveness and a slight draw bias from their driver.", "has_degrees": true, "price": "490.00", "image_url": null, "image": "callaway-paradym-ladies-driver.jpg"}}, {"model": "products.product", "pk": 3, "fields": {"category": 2, "gender": 1, "sku": "ir01ml", "name": "Titleist 620 CB 4-PW", "brand": 6, "description": "The new 620 CB irons stay true to everything players have come to trust from this classic model, with distinct refinements that make them better than ever.\r\n\r\n- Reduced offset and topline for the ultimate player’s look\r\n- Progressive blade length for optimized play throughout the set\r\n- Co-forged tungsten in 4-iron for improved balance\r\n- Tour-refined sole for improved turf interaction", "has_degrees": false, "price": "1170.00", "image_url": null, "image": "titleist-620CB.webp"}}, {"model": "products.product", "pk": 4, "fields": {"category": 2, "gender": 2, "sku": "ir01wn", "name": "COBRA FLY XL LADIES IRONS 4-SW", "brand": 8, "description": "With the FLY XL irons, you can launch it higher, swing it quicker, and hit it straighter. Designed for moderate swing speeds with ultra-light construction to help you perform at your best. Lighter shaft weights aid golfers with moderate swing speeds in generating greater clubhead speed for maximum distance with less effort. Swing weights that are lighter improve comfort during the swing, allowing moderate swingers to improve their launch and pace.\r\n\r\nThe FLY XL Irons include a back-to-heel CG placement, offset hosel neck, and higher lofts to help with launch and forgiveness. All of this is designed to assist you in hitting the ball straighter and with a higher, more controllable launch.\r\n\r\nThe lower profile clubhead with a deep undercut head design moves the CG (centre of gravity) lower and further back for increased launch, while the deeper undercut generates more face flex for maximum ball speed on off-centre smashes.\r\n\r\nA high-class game improvement set of Irons for life. Forgiving clubs that deliver easy launch and distance for the aspiring golfer.", "has_degrees": false, "price": "600.00", "image_url": null, "image": "Ladies-cobra-fly-irons.webp"}}, {"model": "products.product", "pk": 8, "fields": {"category": 1, "gender": 1, "sku": "dr02ml", "name": "Ping G430 HL Max Driver Gents", "brand": 7, "description": "Pushing the limits of MOI is the MAX driver’s modus operandi and it’s the biggest (460cc) and most forgiving G430 model. With 25g of high-density tungsten to play with, in the form of an adjustable backweight, the MAX can be configured for a draw or fade. But its aim-and-bomb simplicity will appeal to the widest range of golfers.", "has_degrees": true, "price": "600.00", "image_url": null, "image": "ping_g430_mens.jpg"}}, {"model": "products.product", "pk": 9, "fields": {"category": 1, "gender": 2, "sku": "dr02wn", "name": "TAYLORMADE SIM2 MAX DRIVER LADIES", "brand": 1, "description": "The TaylorMade Ladies SIM 2 Max Driver is the shape of forgiveness with new innovative forged ring construction technology. Forged Ring Construction is the key that unlocks a new dimension in distance and forgiveness. Forged from a lightweight and high strength aluminum that is milled to an exacting shape, it unites a massive rear weight, a full carbon sole, crown and a new milled back cup face. Creating a driver designed for increased stability and forgiveness, giving golfers the confidence to take on any tee shot.", "has_degrees": true, "price": "450.00", "image_url": null, "image": "SIM-2-Max-Ladies-Driver.webp"}}, {"model": "products.product", "pk": 10, "fields": {"category": 2, "gender": 1, "sku": "ir02ml", "name": "TAYLORMADE P7 MC", "brand": 1, "description": "Designed with direct input from Tour, P • 7MC irons feature a thin topline and progressive\r\noffset for a clean look at address. A narrow sole and tight leading edge ensure\r\nconsistency through the turf. Every angle is meticulously scrutinized to meet the performance demands of the game’s best ball strikers with perimeter weighting to provide just the right amount of\r\nforgiveness.", "has_degrees": false, "price": "1500.00", "image_url": null, "image": "taylormade-p7-mc-men.jpg"}}, {"model": "products.product", "pk": 11, "fields": {"category": 2, "gender": 2, "sku": "ir02wn", "name": "TITLEIST T300 IRONS 2021", "brand": 6, "description": "The Ultimate Game Improvement Iron - with 40% more tungsten and advanced Max Impact Technology, the new T300 can improve your launch, distance and shot making while providing maximum forgiveness. All in a premium chrome head with the size and shape to give you the confidence to play your best golf.\r\n\r\nT300 produces impressive distance gains through an evolved Max Impact technology and new variable face design while providing even greater forgiveness thanks to a massive 40% increase in tungsten weighting. A new chrome finish provides an added premium touch.", "has_degrees": false, "price": "1200.00", "image_url": null, "image": "womens-t300-irons.png"}}, {"model": "products.product", "pk": 12, "fields": {"category": 3, "gender": 1, "sku": "wd01ml", "name": "CALLAWAY JAWS MD5 22 WEDGE", "brand": 4, "description": "Innovative JAWS groove designed with extremely sharp edge\r\nradius to impart more spin for precise control.\r\nHead shaping progresses from traditional shaped lob and\r\nsand wedges to a compact player preferred design in the gap\r\nwedge.", "has_degrees": true, "price": "120.00", "image_url": null, "image": "callaway-jaws-mens.jpg"}}, {"model": "products.product", "pk": 13, "fields": {"category": 3, "gender": 2, "sku": "wd01wn", "name": "CLEVELAND GOLF LADIES CBX ZIPCORE WEDGE", "brand": 3, "description": "The perfect blend of short game forgiveness and versatility for players that never apologize for stepping their game up .Sharper, deeper, and closer together, UltiZip Grooves are more efficient at channeling debris and maximizing spin. Plus, there’s two extra grooves per face for more groove contact across the board.", "has_degrees": true, "price": "100.00", "image_url": null, "image": "cbx-zipcore-wedge-ladies.jpg"}}, {"model": "products.product", "pk": 14, "fields": {"category": 3, "gender": 2, "sku": "wd02wn", "name": "CLEVELAND GOLF SMART SOLE 4 WEDGE", "brand": 3, "description": "The Smart Sole 4 makes the short game easier. Featuring an extra wide sole and improved Feel Balancing Technology, the Smart Sole 4 delivers maximum forgiveness and easier bunker play for those needing more short game assistance. Smart Sole 4 features an extra wide sole across all three models with extra leading edge bounce to ensure crisp, clean contact and better stability. Upgraded Feel Balancing Technology adjusts the center of gravity closer to sweet spot for better feel, while new premium milled grooves channel moisture and debris away from the impact zone for improved spin performance from any conditions.", "has_degrees": true, "price": "130.00", "image_url": null, "image": "smart-sole-4-wedge-womens.jpg"}}, {"model": "products.product", "pk": 15, "fields": {"category": 3, "gender": 1, "sku": "wd02ml", "name": "TITLEIST SM9 TOUR CHROME", "brand": 6, "description": "Great wedge play comes from shot versatility, distance control and spin. The materials and structure of SM9 wedges represent our most technologically advanced design in all three areas, tuned for precise contact, lower flight and higher spin. Your swing is unique and requires a unique wedge. Finding the right grind for your swing type will provide you flawless contact, so you can be prepared to hit every kind of wedge shot in all conditions. For every shot, every lie, every course, there’s a grind fit for your swing. A new Spin Milled cutting process in the SM9 models – which includes tightening our allowable tolerances - produces consistently sharper grooves wedge after wedge, resulting in higher, more consistent spin rates. Spin Milled Grooves are the Gold Standard in groove cutting precision - meticulously engineered and cut to the edge to maximise spin and shot control. Each Vokey wedge head is 100% inspected for utmost quality and performance.", "has_degrees": true, "price": "190.00", "image_url": null, "image": "titleist-sm9-wedge-mens.jpg"}}, {"model": "products.product", "pk": 16, "fields": {"category": 4, "gender": 1, "sku": "pu01ml", "name": "TAYLORMADE SPIDER GTX CENTER SHAFT SILVER PUTTER", "brand": 1, "description": "Spider GTX sets the standard for performance and construction. The GTX shape resembles the past Spider shapes with True Path and a new extreme back weighting for forgiveness. Made from lightweight 6061 Aluminum, the 194 gram top allows more weight to transfer to the outside of the frame. The back weight ring is made of heavy stainless steel – 154 grams, that creates a deeper CG for less face rotation and enhanced stability.", "has_degrees": false, "price": "300.00", "image_url": null, "image": "taylormade-spider-gtx-men.jpg"}}, {"model": "products.product", "pk": 17, "fields": {"category": 4, "gender": 1, "sku": "pu02ml", "name": "SCOTTY CAMERON SUPER SELECT NEWPORT 2 PLUS PUTTER", "brand": 9, "description": "Scotty Cameron builds upon the Tour-proven success of 2020's Special Select line and introduces his new Super Select models in 2023. Ten models comprise the new 2023 Super Select line, which will be introduced in two worldwide releases. With a flange crafted slightly wider than a Super Select Newport 2 and narrower than a Super Select Squareback 2, the Super Select Newport 2 Plus offers a Tour-inspired shape that introduces the next profile in high-performance blade design. Milled in USA from 303 stainless steel with a solid face, the Newport 2 Plus has a 6061 aircraft grade aluminum sole plate, anodized clear and engraved with the line’s graphics. The sole plate allows for weight to be designed into the perimeter of the putter head for higher MOI and increased stability. A milled flange sight line provides clean alignment, while customizable stainless steel sole weights provide balance. The Super Select Newport 2 Plus includes the line’s shaft band, headcover and textured Pistolini Plus grip.", "has_degrees": false, "price": "500.00", "image_url": null, "image": "scotty-SuperSelect-Newport2-mens-putter.webp"}}, {"model": "products.product", "pk": 18, "fields": {"category": 4, "gender": 2, "sku": "pu01wn", "name": "TAYLORMADE LADIES SPIDER GTX PINK SB PUTTER", "brand": 1, "description": "Spider GTX sets the standard for performance and construction. The GTX shape resembles the past Spider shapes with True Path and a new extreme back weighting for forgiveness. CAP Made from lightweight 6061 Aluminum, the 194 gram top allows more weight to transfer to the outside of the frame. The back weight ring is made of heavy stainless steel – 154 grams, that creates a deeper CG for less face rotation and enhanced stability.", "has_degrees": false, "price": "450.00", "image_url": null, "image": "taylormade-gtx-women.jpg"}}, {"model": "products.product", "pk": 19, "fields": {"category": 4, "gender": 2, "sku": "pu02wn", "name": "PING G LE2 LADIES ECHO PUTTER", "brand": 7, "description": "Enhanced feel and forgiveness and a new adjustable-length shaft improve performance and fitting opportunities in the three new G Le2 putters (Anser, Shea and Echo). A dual-durometer Pebax face insert – engineered with TR face technology – provides a soft layer for precision and improved impact feel and a firmer layer for control improves consistency on putts of every distance. The easy-to-use adjustable shaft allows self-fitting for length between 31\" and 35\". A new, softer PP59 midsize grip improves feel and comfort.", "has_degrees": false, "price": "310.00", "image_url": null, "image": "ping-gle-2-echo-putter-womens.webp"}}, {"model": "products.product", "pk": 20, "fields": {"category": 5, "gender": null, "sku": "acc01", "name": "Masters Bamboo Tees 2 3/4 x 20 Pack", "brand": null, "description": "Masters are replacing their own branded tees from wood to bamboo in attempt to provide customers with more sustainable choices. Made from sustainably sourced bamboo, these tees are not only a great green story but are fully bio-degradable and a great alternative to wooden and plastic tees making them better for the course, and the environment. Contains zero plastic in both product and packaging. Halpenny Golf currently serve over 125,000 returning customers and we pride ourselves in working to exacting international quality management standards. Our staff have a passion for Golf. With a PGA Professional in every store our customers can be sure that they get the best and most suitable advice for their every golfing need. We try harder to please, so buy with confidence at Halpenny Golf, the trusted Professionals.", "has_degrees": false, "price": "2.00", "image_url": null, "image": "bamboo-tees.jpg"}}, {"model": "products.product", "pk": 21, "fields": {"category": 5, "gender": null, "sku": "acc02", "name": "TAYLORMADE STRATUS SOFT GOLF GLOVE", "brand": 1, "description": "This new addition to the family of TaylorMade gloves combines the best of both worlds - the versatile fit of a synthetic material and the feel of genuine leather. The top hand is made from a durable and breathable synthetic that maintains stretch for additional comfort, while the leather palm adds tackiness, durability and feel. The materials were also selected for their ability to resist cracking and fend off wear and tear.", "has_degrees": false, "price": "15.00", "image_url": null, "image": "taylormade-stratus-glove.jpg"}}, {"model": "products.product", "pk": 22, "fields": {"category": 5, "gender": null, "sku": "acc03", "name": "NIKE GOLF PERFORMANCE GOLF TOWEL BLACK/GOLD", "brand": 2, "description": "Soft, moisture absorbing fabric safely cleans clubs - Carabiner clasp provides quick and easy release", "has_degrees": false, "price": "26.00", "image_url": null, "image": "nike-towel.jpg"}}, {"model": "products.product", "pk": 23, "fields": {"category": 5, "gender": null, "sku": "acc04", "name": "NIKE GOLF INFINITY TOUR NEXT MENS GOLF SHOES", "brand": 2, "description": "Limited Edition With Tour Level Performance Nike have listened to feedback on the Infinity Tour, redefined it and brought it back to life in the Nike Air Zoom Infinity Tour NEXT%. They've increased the overall volume to give you more room, updated the forefoot cushioning to include two Zoom Air units for even more energy transfer through your swing, and added more traction to key areas to help reduce slipping. The result is an incredibly responsive, comfortable shoe that we know you're going to love. Breathable textile helps your foot stay cool. The material hugs and supports you through every step for extra support and comfort. A plush, padded collar helps reduce heel slip while you move. Two Zoom Air units in the forefoot respond to every step. Because they're not fully enclosed, they can move with your foot, allowing for better energy return when you push off through your swing.", "has_degrees": false, "price": "170.00", "image_url": null, "image": "air-zoom-infinity-tour-next-golf-shoes.png"}}, {"model": "products.product", "pk": 24, "fields": {"category": 5, "gender": null, "sku": "acc05", "name": "FOOTJOY FUEL WOMENS GOLF SHOES", "brand": 5, "description": "NEW upper material utilising mesh and using ultra-thin TPU Hot Melt top layer\r\nThe Power Stabiliser outsole features tour-proven traction with an all new Stability Bridge to provide optimal support and control.\r\nStratolite foam delivers lightweight cushioning and ensure ultimate comfort and max walkability round after round.\r\nOffers a full rounded toe character with a full fit across the forefoot and instep. A toe spring and a slightly narrow heel completes the athletic profile.\r\nFootJoy warrants that this golf shoe will be 100% waterproof in normal use for one year.", "has_degrees": false, "price": "140.00", "image_url": null, "image": "fj-fuel-women-shoes.webp"}}]